{
  "_name_or_path": "alfa-nlp/sentiment-classifier-ru",
  "architectures": ["SentimentClassifier"],
  "model_type": "sentiment_classifier",
  "auto_map": {
    "AutoConfig": "modeling_classifier.SentimentConfig",
    "AutoModel": "modeling_classifier.SentimentClassifier"
  },
  "num_labels": 2,
  "id2label": {"0": "NEGATIVE", "1": "POSITIVE"},
  "label2id": {"NEGATIVE": 0, "POSITIVE": 1},
  "hidden_size": 768,
  "hidden_dropout_prob": 0.1,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-12,
  "torch_dtype": "float32",
  "transformers_version": "4.40.1"
}
